snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Documents/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвиженияДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоПоАвансамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Приход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаБанкКлиент</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПоБанку</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС_Бух</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_СтрокиПлатежа</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкиЗатрат</name>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ManagerModule.bsl
Функция СоздатьППвходящие(ДокСсылка) Экспорт
	ПометитьНаУдалениеЛишниеПП(ДокСсылка);
	СоздатьПП(ДокСсылка);
КонецФункции //СоздатьППвходящие()

Функция ПометитьНаУдалениеЛишниеПП(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ПРС.Ссылка					КАК ППВход,
	|	Платежи.УИД_СтрокиПлатежа	КАК УИД_СтрокиПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО 
	|	ПРС.ДокОснование = Платежи.Ссылка
	|	И ПРС.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|ГДЕ
	|	ПРС.ДокОснование = &ДокСсылка
	|	И НЕ ПРС.ПометкаУдаления
	|	И Платежи.УИД_СтрокиПлатежа ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.ППВход.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Выборка.Количество();
КонецФункции //ПометитьНаУдалениеЛишниеПП(ДокСсылка)

Функция СоздатьПП(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Платежи.УИД_СтрокиПлатежа		КАК УИД_СтрокиПлатежа,
	|	Платежи.Ссылка					КАК ДокОснование,
	|	Платежи.Ссылка.Организация		КАК Организация,
	|	Платежи.Ссылка.БанковскийСчет	КАК СчетОрганизации,
	|	Платежи.Ссылка.Дата				КАК Дата,
	|	Платежи.КонтрагентПоБанку		КАК Контрагент,
	|	Платежи.Договор					КАК Договор,
	|	Платежи.Приход					КАК СуммаДокумента,
	|	Платежи.Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	Платежи.СтатьяДДС				КАК СтатьяДДС,
	|	Платежи.НазначениеПлатежа		КАК НазначениеПлатежа,
	|	Платежи.СтрокаБанкКлиент		КАК СтрокаБанкКлиент,	
	|
	|	ПРС.Ссылка						КАК ППВход
	|
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС	
	|ПО 
	|	ПРС.ДокОснование = Платежи.Ссылка
	|	И ПРС.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|ГДЕ
	|	Платежи.Ссылка = &ДокСсылка	
	|	И Платежи.УИД_СтрокиПлатежа <> &ПустойУИД
	|	И Платежи.Приход > 0
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
		
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД());
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ППВход) Тогда
			ДокОбъект = Выборка.ППВход.ПолучитьОбъект();
		Иначе
			ДокОбъект 		= Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();			
			ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка);
		ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьНомерДатуПП(Выборка.СтрокаБанкКлиент));
		
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Выборка.Количество();
КонецФункции //СоздатьПП(ДокСсылка)

Функция ПолучитьНомерДатуПП(СтрокаБанкКлиент)
	Результат = Новый Структура("НомерВходящегоДокумента,ДатаВходящегоДокумента", "", ПустаяДата());
	
	Части = СтрРазделить(СтрокаБанкКлиент, Символы.ПС);	
	Для каждого Стр Из Части Цикл
		Поля = МаркировкаКС.СтрокуВСтруктуру(Стр, "Ключ,Значение", "=");
		Если ВРег(Поля.Ключ) = "НОМЕР" Тогда
			Результат.НомерВходящегоДокумента = СокрЛП(Поля.Значение);					
		КонецЕсли;		
		Если ВРег(Поля.Ключ) = "ДАТА" Тогда
			Результат.ДатаВходящегоДокумента = ПолучитьДатуИзСтроки(СокрЛП(Поля.Значение));
		КонецЕсли;	                                                     
		Если ЗначениеЗаполнено(Результат.ДатаВходящегоДокумента) И ЗначениеЗаполнено(Результат.НомерВходящегоДокумента) Тогда
			Прервать;		
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //ПолучитьНомерДатуПП(СтрокаБанкКлиент)

Функция ПолучитьДатуИзСтроки(СтрДаты)
	Результат = ПустаяДата();
	
	Части = СтрРазделить(СтрДаты, ".");	
	Если Части.Количество() < 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	
	ТипЧисло = ПолучитьОписаниеТиповЧисла(10,0);
	
	ЧислоДаты	= Части[0];
	МесяцДаты 	= Части[1];	
	ГодДаты 	= Части[2];
	Если СтрДлина(ГодДаты) = 2 Тогда
		Если Число(ГодДаты) < 50 Тогда
			ГодДаты = "20" + ГодДаты;
		Иначе
			ГодДаты = "19" + ГодДаты ;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Результат = Дата(ТипЧисло.ПривестиЗначение(ГодДаты), ТипЧисло.ПривестиЗначение(МесяцДаты), ТипЧисло.ПривестиЗначение(ЧислоДаты));		
	Исключение		
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции
